scripts/exp1/redis-sls-10-03.txt
====== PING_INLINE ======
  100000 requests completed in 16.02 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.07% <= 0.4 milliseconds
1.28% <= 0.5 milliseconds
6.39% <= 0.6 milliseconds
15.50% <= 0.7 milliseconds
24.73% <= 0.8 milliseconds
30.66% <= 0.9 milliseconds
32.82% <= 1.0 milliseconds
34.18% <= 1.1 milliseconds
35.63% <= 1.2 milliseconds
37.14% <= 1.3 milliseconds
38.92% <= 1.4 milliseconds
40.85% <= 1.5 milliseconds
42.69% <= 1.6 milliseconds
44.42% <= 1.7 milliseconds
46.02% <= 1.8 milliseconds
47.52% <= 1.9 milliseconds
48.91% <= 2.0 milliseconds
50.18% <= 2.1 milliseconds
50.18% <= 2 milliseconds
55.60% <= 3 milliseconds
55.71% <= 4 milliseconds
55.76% <= 5 milliseconds
55.88% <= 6 milliseconds
58.17% <= 7 milliseconds
63.42% <= 8 milliseconds
66.15% <= 9 milliseconds
68.38% <= 10 milliseconds
68.70% <= 11 milliseconds
70.91% <= 12 milliseconds
71.67% <= 15 milliseconds
71.75% <= 16 milliseconds
72.70% <= 17 milliseconds
79.46% <= 18 milliseconds
85.87% <= 19 milliseconds
93.53% <= 20 milliseconds
95.88% <= 21 milliseconds
98.72% <= 22 milliseconds
99.89% <= 23 milliseconds
99.93% <= 32 milliseconds
99.95% <= 33 milliseconds
99.98% <= 36 milliseconds
100.00% <= 37 milliseconds
6243.76 requests per second

====== PING_BULK ======
  100000 requests completed in 15.51 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

33.49% <= 1 milliseconds
50.12% <= 2 milliseconds
56.99% <= 3 milliseconds
57.09% <= 4 milliseconds
57.10% <= 5 milliseconds
57.22% <= 6 milliseconds
59.44% <= 7 milliseconds
65.70% <= 8 milliseconds
68.26% <= 9 milliseconds
70.32% <= 10 milliseconds
70.65% <= 11 milliseconds
72.18% <= 12 milliseconds
72.56% <= 13 milliseconds
72.63% <= 14 milliseconds
72.65% <= 15 milliseconds
72.71% <= 16 milliseconds
73.78% <= 17 milliseconds
80.82% <= 18 milliseconds
86.21% <= 19 milliseconds
93.18% <= 20 milliseconds
94.84% <= 21 milliseconds
98.51% <= 22 milliseconds
99.89% <= 23 milliseconds
99.92% <= 24 milliseconds
99.94% <= 25 milliseconds
99.95% <= 27 milliseconds
99.96% <= 28 milliseconds
99.98% <= 30 milliseconds
100.00% <= 31 milliseconds
100.00% <= 31 milliseconds
6448.70 requests per second

====== SET ======
  100000 requests completed in 15.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

33.68% <= 1 milliseconds
50.01% <= 2 milliseconds
56.95% <= 3 milliseconds
56.98% <= 5 milliseconds
57.03% <= 6 milliseconds
59.28% <= 7 milliseconds
65.03% <= 8 milliseconds
67.19% <= 9 milliseconds
69.35% <= 10 milliseconds
69.64% <= 11 milliseconds
71.02% <= 12 milliseconds
71.47% <= 13 milliseconds
71.48% <= 15 milliseconds
71.53% <= 16 milliseconds
72.65% <= 17 milliseconds
79.01% <= 18 milliseconds
85.36% <= 19 milliseconds
92.51% <= 20 milliseconds
94.53% <= 21 milliseconds
98.84% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 23 milliseconds
6330.32 requests per second

====== GET ======
  100000 requests completed in 15.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

34.77% <= 1 milliseconds
51.08% <= 2 milliseconds
58.01% <= 3 milliseconds
58.03% <= 4 milliseconds
58.06% <= 5 milliseconds
58.14% <= 6 milliseconds
60.05% <= 7 milliseconds
65.97% <= 8 milliseconds
68.64% <= 9 milliseconds
70.75% <= 10 milliseconds
71.08% <= 11 milliseconds
73.09% <= 12 milliseconds
73.74% <= 13 milliseconds
73.78% <= 14 milliseconds
73.78% <= 15 milliseconds
73.80% <= 16 milliseconds
74.94% <= 17 milliseconds
81.64% <= 18 milliseconds
87.10% <= 19 milliseconds
93.32% <= 20 milliseconds
95.15% <= 21 milliseconds
98.64% <= 22 milliseconds
99.91% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 24 milliseconds
6594.13 requests per second

====== INCR ======
  100000 requests completed in 14.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

31.39% <= 1 milliseconds
50.65% <= 2 milliseconds
58.66% <= 3 milliseconds
58.72% <= 4 milliseconds
58.73% <= 5 milliseconds
58.82% <= 6 milliseconds
61.76% <= 7 milliseconds
68.25% <= 8 milliseconds
70.50% <= 9 milliseconds
72.07% <= 10 milliseconds
72.40% <= 11 milliseconds
74.29% <= 12 milliseconds
75.02% <= 13 milliseconds
75.07% <= 14 milliseconds
75.07% <= 15 milliseconds
75.10% <= 16 milliseconds
76.43% <= 17 milliseconds
84.60% <= 18 milliseconds
88.93% <= 19 milliseconds
94.09% <= 20 milliseconds
95.54% <= 21 milliseconds
98.78% <= 22 milliseconds
99.93% <= 23 milliseconds
100.00% <= 23 milliseconds
6804.11 requests per second

====== LPUSH ======
  100000 requests completed in 9.83 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

34.06% <= 1 milliseconds
52.77% <= 2 milliseconds
66.88% <= 3 milliseconds
66.96% <= 4 milliseconds
67.01% <= 5 milliseconds
67.44% <= 6 milliseconds
75.86% <= 7 milliseconds
85.84% <= 8 milliseconds
86.68% <= 9 milliseconds
86.81% <= 10 milliseconds
86.91% <= 11 milliseconds
90.86% <= 12 milliseconds
93.48% <= 13 milliseconds
93.54% <= 14 milliseconds
93.62% <= 15 milliseconds
93.68% <= 16 milliseconds
94.58% <= 17 milliseconds
96.40% <= 18 milliseconds
96.67% <= 19 milliseconds
96.95% <= 20 milliseconds
97.08% <= 21 milliseconds
98.95% <= 22 milliseconds
99.89% <= 23 milliseconds
99.93% <= 24 milliseconds
99.93% <= 25 milliseconds
99.94% <= 26 milliseconds
99.95% <= 27 milliseconds
99.98% <= 36 milliseconds
99.99% <= 37 milliseconds
100.00% <= 37 milliseconds
10177.08 requests per second

====== RPUSH ======
  100000 requests completed in 3.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

94.72% <= 1 milliseconds
96.61% <= 2 milliseconds
97.80% <= 3 milliseconds
97.80% <= 5 milliseconds
97.87% <= 6 milliseconds
98.65% <= 7 milliseconds
99.10% <= 8 milliseconds
99.10% <= 10 milliseconds
99.13% <= 11 milliseconds
99.47% <= 12 milliseconds
99.75% <= 13 milliseconds
99.75% <= 15 milliseconds
99.78% <= 16 milliseconds
99.87% <= 17 milliseconds
99.95% <= 18 milliseconds
99.95% <= 19 milliseconds
99.96% <= 20 milliseconds
100.00% <= 20 milliseconds
32289.31 requests per second

====== LPOP ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.59% <= 1 milliseconds
100.00% <= 1 milliseconds
37650.61 requests per second

====== RPOP ======
  100000 requests completed in 2.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.50% <= 1 milliseconds
99.89% <= 2 milliseconds
99.95% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 5 milliseconds
36576.45 requests per second

====== SADD ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.74% <= 1 milliseconds
99.91% <= 2 milliseconds
99.96% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
37693.18 requests per second

====== HSET ======
  100000 requests completed in 2.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.96% <= 1 milliseconds
100.00% <= 1 milliseconds
38037.28 requests per second

====== SPOP ======
  100000 requests completed in 2.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.79% <= 1 milliseconds
99.90% <= 2 milliseconds
99.95% <= 3 milliseconds
99.96% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
37878.79 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.98% <= 1 milliseconds
100.00% <= 1 milliseconds
37850.11 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.39% <= 1 milliseconds
99.90% <= 2 milliseconds
99.95% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
30656.04 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.36 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
99.90% <= 2 milliseconds
99.93% <= 3 milliseconds
99.96% <= 4 milliseconds
99.97% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 7 milliseconds
18674.14 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 6.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
99.46% <= 2 milliseconds
99.94% <= 3 milliseconds
99.96% <= 4 milliseconds
99.97% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
14341.03 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
68.28% <= 2 milliseconds
99.87% <= 3 milliseconds
99.93% <= 4 milliseconds
99.95% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
12743.72 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.90% <= 1 milliseconds
100.00% <= 1 milliseconds
37369.21 requests per second